---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.LoadBase
source: html/b7578e40-cafd-2f98-9289-907e5eb3969d.htm
---
# LoadBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.